src/bsl/InformationRegisters/гкс_РезультатыНормативнойСертификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_РезультатыНормативнойСертификацииНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИскатьВнешниеПробы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательАнализа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользованияКачества</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СегментацияКачестваНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СегментацияКачестваНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ПриоритетыПоказателейКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПриоритетыПоказателейКачества</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Documents/гкс_НормативнаяСертификацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_НормативнаяСертификацияНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гкс_РезультатыНормативнойСертификацииНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_НазначениеИспользованияКачества</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ВидПеревозки</Name>
					<Comment>ERP-2184</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Анализы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательАнализа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонятьКачество</Name>
							<Comment>При отклонении от нормы - отклонять качество</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИскатьВнешниеПробы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/CommonModules/гкс_РаботаСПоказателямиНоменклатуры/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Дата окончания периода сертификации.
//
// Возвращаемое значение:
//  Дата - Дата окончания периода сертификации
//
Функция ДатаОкончанияПериодаСертификации() Экспорт

	Возврат Константы.гкс_ДатаОкончанияПериодаСертификацииПоУмолчанию.Получить();

КонецФункции

// Возвращает массив нормативных показателей по условиям.
//
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - ПЛК
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - Вид перевозки
//  НазначениеИспользованияКачества - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества -
//  Период - Неопределено, Дата, Структура - Период
//
//  Массив из Структура
//			*Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - Показатель усиленного контроля
//			*ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - единица измерения показателя
//
Функция НормативныеПоказатели(ТочкаМаршрута, Номенклатура, ВидПеревозки, НазначениеИспользованияКачества,
	Период = Неопределено) Экспорт

    УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НормативнаяСертификация.ПоказательАнализа КАК Показатель,
		|	НормативнаяСертификация.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	НормативнаяСертификация.ОтклонятьКачество КАК ОтклонятьКачество,
		|	НормативнаяСертификация.ИскатьВнешниеПробы КАК ИскатьВнешниеПробы
		|ИЗ
		|	РегистрСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры.СрезПоследних(
		|			&ДатаОкончания,
		|			Номенклатура = &Номенклатура
		|				И ТочкаМаршрута = &ТочкаМаршрута
		|				И ВидПеревозки = &ВидПеревозки
		|				И НазначениеИспользованияКачества = &НазначениеИспользованияКачества) КАК НормативнаяСертификация
		|ГДЕ
		|	НормативнаяСертификация.ПериодС <= &ДатаНачала
		|	И НормативнаяСертификация.ПериодПо >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ)";

	Если ТипЗнч(Период) = Тип("Дата") Тогда

		ДатаНачала = Период;
		ДатаОкончания = Период;

	ИначеЕсли ТипЗнч(Период) = Тип("Структура")
	И Период.Свойство("ДатаНачала") И Период.Свойство("ДатаОкончания") Тогда

		ДатаНачала = ?(ЗначениеЗаполнено(Период.ДатаНачала), Период.ДатаНачала, ТекущаяДатаСеанса());
		ДатаОкончания = ?(ЗначениеЗаполнено(Период.ДатаОкончания),
							Период.ДатаОкончания, ДатаОкончанияПериодаСертификации());

	Иначе
		ДатаНачала = ТекущаяДатаСеанса();
		ДатаОкончания = ДатаНачала;
	КонецЕсли;

	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", НазначениеИспользованияКачества);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Данные = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Подбирает спецификацию по фактическим значениям лабораторного анализа.
//
// Параметры:
//  ЛабораторныйАнализ - ДокументОбъект.гкс_ЛабораторныйАнализ - лабораторный анализ
//
// Возвращаемое значение:
// 	ДокументСсылка.гкс_НормативнаяСертификацияНоменклатуры - Нормативная спецификация
//
Функция НормативнаяСертификацияПоФактическомуКачеству(ЛабораторныйАнализ) Экспорт

	Если ТипЗнч(ЛабораторныйАнализ.гкс_ДокументРегистрации) <> Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		Возврат Документы.гкс_НормативнаяСертификацияНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", ЛабораторныйАнализ.Номенклатура);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ЛабораторныйАнализ.ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ЛабораторныйАнализ.гкс_ВидПеревозки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества);

	Запрос.УстановитьПараметр("КачественныеПоказатели", ЛабораторныйАнализ.КачественныеПоказатели.Выгрузить());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель,
	|	ЛабораторныйАнализКачественныеПоказатели.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_РезультатыАнализа
	|ИЗ
	|	&КачественныеПоказатели КАК ЛабораторныйАнализКачественныеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Номенклатура КАК Номенклатура,
	|	&ТочкаМаршрута КАК ТочкаМаршрута,
	|	&ВидПеревозки КАК ВидПеревозки,
	|	&НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ЕСТЬNULL(СегментацияКачестваНоменклатуры.СлужебнаяНоменклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК СлужебнаяНоменклатура
	|ПОМЕСТИТЬ ВТ_КлючиПоиска
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СегментацияКачестваНоменклатуры КАК СегментацияКачестваНоменклатуры
	|		ПО (СегментацияКачестваНоменклатуры.Номенклатура = &Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоиска.Номенклатура КАК Номенклатура,
	|	ВТ_КлючиПоиска.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ВТ_КлючиПоиска.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_КлючиПоиска.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ВТ_КлючиПоиска.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	НормативнаяСертификацияНоменклатуры.Ссылка КАК НормативнаяСертификация
	|ПОМЕСТИТЬ ВТ_КлючиПоискаИСпецификация
	|ИЗ
	|	ВТ_КлючиПоиска КАК ВТ_КлючиПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры КАК НормативнаяСертификацияНоменклатуры
	|		ПО ВТ_КлючиПоиска.ТочкаМаршрута = НормативнаяСертификацияНоменклатуры.ТочкаМаршрута
	|			И ВТ_КлючиПоиска.ВидПеревозки = НормативнаяСертификацияНоменклатуры.гкс_ВидПеревозки
	|			И ВТ_КлючиПоиска.НазначениеИспользованияКачества = НормативнаяСертификацияНоменклатуры.гкс_НазначениеИспользованияКачества
	|			И ВТ_КлючиПоиска.СлужебнаяНоменклатура = НормативнаяСертификацияНоменклатуры.Номенклатура
	|			И (НормативнаяСертификацияНоменклатуры.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоискаИСпецификация.Номенклатура КАК Номенклатура,
	|	ВТ_КлючиПоискаИСпецификация.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация КАК НормативнаяСертификация,
	|	НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа КАК Показатель,
	|	НормативнаяСертификацияНоменклатурыАнализы.ЗначениеПоказателя КАК ЗначениеМин,
	|	НормативнаяСертификацияНоменклатурыАнализы.МаксЗначениеПоказателя КАК ЗначениеМакс,
	|	ЕСТЬNULL(ПриоритетыПоказателейКачества.Приоритет, 0) КАК Приоритет,
	|	ВТ_РезультатыАнализа.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ТаблицаПодбора
	|ИЗ
	|	ВТ_КлючиПоискаИСпецификация КАК ВТ_КлючиПоискаИСпецификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ПО ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПриоритетыПоказателейКачества КАК ПриоритетыПоказателейКачества
	|		ПО (НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа = ПриоритетыПоказателейКачества.Показатель)
	|			И ВТ_КлючиПоискаИСпецификация.Номенклатура = ПриоритетыПоказателейКачества.Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РезультатыАнализа КАК ВТ_РезультатыАнализа
	|		ПО (НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа = ВТ_РезультатыАнализа.Показатель)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПриоритетыПоказателейКачества.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыМаксимум
	|ИЗ
	|	РегистрСведений.гкс_ПриоритетыПоказателейКачества КАК ПриоритетыПоказателейКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиПоиска КАК ВТ_КлючиПоиска
	|		ПО (ВТ_КлючиПоиска.Номенклатура = ПриоритетыПоказателейКачества.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация КАК НормативнаяСертификация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа) КАК КоличествоПоказателей
	|ПОМЕСТИТЬ ВТ_ИтогиПоСпецификации
	|ИЗ
	|	ВТ_КлючиПоискаИСпецификация КАК ВТ_КлючиПоискаИСпецификация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ПО ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация = НормативнаяСертификацияНоменклатурыАнализы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КлючиПоискаИСпецификация.НормативнаяСертификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПодбора.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_ТаблицаПодбора.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_ТаблицаПодбора.Показатель КАК Показатель,
	|	ВТ_ТаблицаПодбора.ЗначениеМин КАК ЗначениеМин,
	|	ВТ_ТаблицаПодбора.ЗначениеМакс КАК ЗначениеМакс,
	|	ВТ_ТаблицаПодбора.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПодбора.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаПодбора.ЗначениеМакс > ВТ_ТаблицаПодбора.Значение
	|				И ВТ_ТаблицаПодбора.Значение >= ВТ_ТаблицаПодбора.ЗначениеМин
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВходитВДиапазон,
	|	ВЫБОР
	|		КОГДА ВТ_ПриоритетыМаксимум.Приоритет = ВТ_ТаблицаПодбора.Приоритет
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВысшийПриоритет,
	|	ЕСТЬNULL(ВТ_ИтогиПоСпецификации.КоличествоПоказателей, 0) КАК КоличествоПоказателей
	|ПОМЕСТИТЬ ВТ_ТаблицаОценок
	|ИЗ
	|	ВТ_ТаблицаПодбора КАК ВТ_ТаблицаПодбора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПоСпецификации КАК ВТ_ИтогиПоСпецификации
	|		ПО ВТ_ТаблицаПодбора.НормативнаяСертификация = ВТ_ИтогиПоСпецификации.НормативнаяСертификация,
	|	ВТ_ПриоритетыМаксимум КАК ВТ_ПриоритетыМаксимум
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОценок.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_ТаблицаОценок.НормативнаяСертификация КАК НормативнаяСертификация,
	|	СУММА(ВТ_ТаблицаОценок.ВходитВДиапазон * ВТ_ТаблицаОценок.ВысшийПриоритет * ВТ_ТаблицаОценок.Приоритет) + ВЫБОР
	|		КОГДА СУММА(ВТ_ТаблицаОценок.ВходитВДиапазон) = МАКСИМУМ(ВТ_ТаблицаОценок.КоличествоПоказателей)
	|				И МАКСИМУМ(ВТ_ТаблицаОценок.КоличествоПоказателей) <> 0
	|			ТОГДА 10
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Расчет
	|ИЗ
	|	ВТ_ТаблицаОценок КАК ВТ_ТаблицаОценок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОценок.СлужебнаяНоменклатура,
	|	ВТ_ТаблицаОценок.НормативнаяСертификация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Расчет.СлужебнаяНоменклатура КАК СлужебнаяНоменклатура,
	|	ВТ_Расчет.НормативнаяСертификация КАК НормативнаяСертификация,
	|	ВТ_Расчет.Коэффициент КАК Коэффициент
	|ИЗ
	|	ВТ_Расчет КАК ВТ_Расчет
	|ГДЕ
	|	ВТ_Расчет.Коэффициент <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент УБЫВ";

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.НормативнаяСертификация;
	Иначе
		Результат = Документы.гкс_НормативнаяСертификацияНоменклатуры.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Показатели усиленного контроля.
// НазначениеИспользования - ПеречислениеСсылка.гкс_НазначенияИспользованияКачества -
// ЛабораторныйАнализ Лабораторный анализ
//
// Параметры:
//  РегистрацияНаПЛК Регистрация на ПЛК
//  НазначениеИспользования Назначение использования
//
// Возвращаемое значение:
//  Массив из Структура - *Показатель - СправочникСсылка.гкс_ПоказателиАнализовНоменклатуры - Показатель усиленного контроля
// *ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения - единица измерения показателя
Функция ПоказателиУсиленногоКонтроля(РегистрацияНаПЛК, НазначениеИспользования) Экспорт

	Результат = Новый Массив;

	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества") Тогда
		Возврат Результат;
	КонецЕсли;

	ТипПробы = Неопределено;
	ДокументыРегистрации = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
		|	ПоказателиАнализовНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО ПоказателиУсиленногоКонтроляПоРегистрации.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|ГДЕ
		|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации В (&ДокументыРегистрации)
		|	И ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = &НазначениеИспользования
		|	И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = &ТипПробы";

	Запрос.УстановитьПараметр("НазначениеИспользования", НазначениеИспользования);

	Если ТипЗнч(РегистрацияНаПЛК) = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда
		ТипПробы = Перечисления.гкс_ТипыПроб.Единичная;

		ДокументыРегистрации = Новый ТаблицаЗначений;
		ДокументыРегистрации.Колонки.Добавить("ДокументРегистрации",
			Новый ОписаниеТипов("ДокументСсылка.гкс_РегистрацияНаПЛК"));
		НоваяСтрока = ДокументыРегистрации.Добавить();
		НоваяСтрока.ДокументРегистрации = РегистрацияНаПЛК;
	Иначе
		ТипПробы = Перечисления.гкс_ТипыПроб.Композитная;
		ДокументыРегистрации = РегистрацияНаПЛК.СписокРегистраций.Выгрузить( ,"ДокументРегистрации");
	КонецЕсли;

	Запрос.УстановитьПараметр("ДокументыРегистрации", ДокументыРегистрации);
	Запрос.УстановитьПараметр("ТипПробы", ТипПробы);


	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Данные = РезультатЗапроса.Выгрузить();
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
	Иначе
		Результат = Новый Массив;
	КонецЕсли;

	Возврат Результат;

КонецФункции


#КонецОбласти
